// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
let time = Math.round(Math.random() * 60);
if (time >= 0 && time < 15) {
    console.log("Число " + time + " знаходиться у першій частині години.");
} else if (time >= 15 && time < 30) {
    console.log("Число " + time + " знаходиться у другій частині години.");
} else if (time >= 30 && time < 45) {
    console.log("Число " + time + " знаходиться у третій частині години.");
} else if (time >= 45 && time < 60) {
    console.log("Число " + time + " знаходиться у четвертій частині години.");
}

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
let day = Math.round(Math.random() * 31);
if (day >= 0 && day < 11){
    console.log("Число " + day + " входить у першу декаду.")
} else if (day >= 11 && day < 21){
    console.log("Число " + day + " входить у другу декаду.")
} else if (day >= 21 && day < 31){
    console.log("Число " + day + " входить у третю декаду.")
}

// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
// let test = '';
//
// if( !!test === true){
//     console.log("Вірно")
// } else {
//     console.log("Неправильно")
// }
//
// let test = false ? "Вірно" : "Неправильно";
// console.log(test);

// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
let a = prompt( "Введіть число від -3 до 1");

if (a === '0'){
    console.log("Вірно")
}else {
    console.log("Невірно")
}

// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.
let weekDay = prompt('Введіть день тиждня');

if(weekDay === '1'){
    console.log("Понеділок. " + "Заплановано понити у ліжку.");
} else if(weekDay === '2'){
    console.log("Вівторок. " + "Заплановано встати з ліжка і привести себе у порядок.");
} else if(weekDay === '3'){
    console.log("Середа. " + "Заплановано піти на роботу.");
} else if(weekDay === '4'){
    console.log("Четвер. " + "Заплановано прийти на роботу.");
} else if(weekDay === '5'){
    console.log("П'ятниця. " + "Заплановано попрацювати.");
} else if(weekDay === '6'){
    console.log("Субота. " + "Заплановано попрацювати.");
} else if(weekDay === '7'){
    console.log("Неділя. " + "Заплановано прийти до дому й лягти спати.");
} else {
    console.log("Ти з нашої планети?");
}

// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
let year = prompt("Скільки днів у цьому році?(Введіть число)")
// високосний рік не ділиться націло на 4
if ( year % 6 === 0){
    console.log("Високосний рік.");
} else {
    console.log("Не високосний рік.");
}

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
let java = prompt("Яка «офіційна» назва JavaScript?");
if (java === 'ECMAScript'){
    console.log("Правильно!")
} else {
    console.log("Не знаєте? ECMAScript!")
}